## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                          NAME                                           |
|----------|-----------------------------------------------------------------------------------------|
| delete   | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-staging.cdssandbox.xyz&quot;]` |
| update   | `aws_wafv2_regex_pattern_set.forms_base_url`                                            |
| recreate | `aws_route53_record.form_viewer[0]`                                                     |
|          | `aws_shield_protection.route53_hosted_zone[0]`                                          |
| add      | `aws_route53_record.form_viewer_certificate_validation[&quot;0&quot;]`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.form_viewer[0] must be replaced
  # (moved from aws_route53_record.form_viewer)
-/+ resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "forms-staging.cdssandbox.xyz" -> (known after apply)
      ~ id              = "Z05990652HOQ0SGHD81ZC_forms-staging.cdssandbox.xyz_A" -> (known after apply)
        name            = "forms-staging.cdssandbox.xyz"
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z05990652HOQ0SGHD81ZC" -> "mocked_zone_id_[\"forms-staging.cdssandbox.xyz\"]" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer_certificate_validation["0"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz"
      + records         = [
          + "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "mocked_zone_id_[\"forms-staging.cdssandbox.xyz\"]"
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-staging.cdssandbox.xyz"] will be destroyed
  # (because key ["forms-staging.cdssandbox.xyz"] is not in for_each map)
  - resource "aws_route53_record" "form_viewer_certificate_validation" {
      - allow_overwrite = true -> null
      - fqdn            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> null
      - id              = "Z05990652HOQ0SGHD81ZC__42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz._CNAME" -> null
      - name            = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz" -> null
      - records         = [
          - "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z05990652HOQ0SGHD81ZC" -> null
    }

  # aws_shield_protection.route53_hosted_zone[0] must be replaced
  # (moved from aws_shield_protection.route53_hosted_zone)
-/+ resource "aws_shield_protection" "route53_hosted_zone" {
      ~ arn          = "arn:aws:shield::687401027353:protection/84aef9e9-74ea-4dfc-bc40-ff3f3ca3700c" -> (known after apply)
      ~ id           = "84aef9e9-74ea-4dfc-bc40-ff3f3ca3700c" -> (known after apply)
        name         = "Route53HostedZone"
      ~ resource_arn = "arn:aws:route53:::hostedzone/Z05990652HOQ0SGHD81ZC" -> "arn:aws:route53:::hostedzone/mocked_zone_id_[\"forms-staging.cdssandbox.xyz\"]" # forces replacement
        tags         = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "92da9411-8b49-4c9e-b80f-ac7ea482f3d1"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "forms-staging.cdssandbox.xyz$" -> null
        }
      + regular_expression {
          + regex_string = "^forms-staging.cdssandbox.xyz$"
        }
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
